tests/TestCompose_of-ccx_fsi.Ubuntu1604.home.PETSc/referenceOutput/Fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          45;
        startFace       5457;
    }
    outlet
    {
        type            patch;
        nFaces          45;
        startFace       5502;
    }
    flap
    {
        type            wall;
        inGroups        1(wall);
        nFaces          33;
        startFace       5547;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          63;
        startFace       5580;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       5643;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5580;
        startFace       5703;
    }
)

// ************************************************************************* //
